INSERT INTO departments (name, code, email) VALUES
('Системное моделирование и автоматизированное проектирование', '316', 'kaf316@mai.ru'),
('Управление высокотехнологичными предприятиями', '315', 'kaf315@mai.ru'),
('Теория вероятностей и компьютерное моделирование', '804', 'kaf804@mai.ru'),
('Кафедра иностранных языков', 'И-06', 'kaf06@mai.ru'),
('Авиационно-космическая теплотехника', '204', 'kaf204@mai.ru');


INSERT INTO groups (code) VALUES
('М3О-335Б-23'),
('М3О-336Б-23'),
('М3О-301Б-23'),
('М3О-235Б-24'),
('М3О-332Б-23'),
('М3О-107Б-25'),
('М3О-416Б-22'),
('М3О-435Б-22');


INSERT INTO disciplines (name, hours, exam_type, department_id) VALUES
('Базы данных', 144, 'EXAM', 1),
('Проектирование информационных систем', 108, 'COURSE_WORK', 1),
('Web-программирование', 120, 'DIFFERENTIAL_CREDIT', 1),
('Java-технологии', 180, 'EXAM', 1),
('Архитектура ЭВМ', 144, 'EXAM', 2),
('Схемотехника', 108, 'CREDIT', 2),
('Математический анализ', 216, 'EXAM', 3),
('Линейная алгебра', 108, 'EXAM', 3),
('Дискретная математика', 144, 'CREDIT', 3),
('Иностранный язык', 72, 'CREDIT', 4),
('Физика', 180, 'EXAM', 5),
('История', 72, 'CREDIT', 4);


INSERT INTO professors (first_name, last_name, hire_date, email, department_id) VALUES
('Алексей', 'Владимирович', '2010-09-01', 'av@mai316.ru', 1),
('Мария', 'Александровна', '2015-02-15', 'ma@mai316.ru', 1),
('Дмитрий', 'Сергеевич', '2008-08-20', 'ds@mai316.ru', 1),
('Елена', 'Николаевна', '2012-11-01', 'en@mai316.ru', 1),
('Сергей', 'Петрович', '2005-03-10', 'sp@mai315.ru', 2),
('Наталья', 'Ивановна', '2011-07-22', 'ni@mai315.ru', 2),
('Михаил', 'Борисович', '2000-09-15', 'mb@mai804.ru', 3),
('Ольга', 'Викторовна', '2013-04-18', 'ov@mai804.ru', 3),
('Татьяна', 'Юрьевна', '2014-08-25', 'ty@mai403.ru', 4),
('Андрей', 'Валерьевич', '2009-01-12', 'av@mai204.ru', 5);


INSERT INTO professor_discipline (professor_id, discipline_id) VALUES
(1, 1), (1, 2),
(1, 3), (2, 1),
(2, 4), (3, 2),
(3, 3), (3, 4),
(4, 1), (4, 2),
(5, 5), (5, 6),
(6, 5), (7, 7),
(7, 8), (7, 9),
(8, 7), (8, 8),
(9, 10),(10, 11),
(10, 12);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Иван', 'Петров', '2005-05-15', 'petrov.335@edu.mai.ru', 1),
('Анна', 'Смирнова', '2004-03-22', 'smirnova.335@edu.mai.ru', 1),
('Дмитрий', 'Козлов', '2005-11-08', 'kozlov.335@edu.mai.ru', 1),
('Екатерина', 'Иванова', '2004-07-19', 'ivanova.335@edu.mai.ru', 1),
('Сергей', 'Морозов', '2003-12-01', 'morozov.335@edu.mai.ru', 1),
('Алина', 'Волкова', '2005-09-30', 'volkova.335@edu.mai.ru', 1);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Максим', 'Соколов', '2004-02-14', 'sokolov.336@edu.mai.ru', 2),
('Дарья', 'Михайлова', '2004-06-27', 'mikhaylova.336@edu.mai.ru', 2),
('Артем', 'Новиков', '2004-10-05', 'novikov.336@edu.mai.ru', 2),
('Полина', 'Кузнецова', '2004-04-18', 'kuznetsova.336@edu.mai.ru', 2),
('Никита', 'Попов', '2003-08-09', 'popov.336@edu.mai.ru', 2);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Владислав', 'Васильев', '2004-01-20', 'vasiliev.337@edu.mai.ru', 3),
('София', 'Зайцева', '2004-07-12', 'zaitseva.337@edu.mai.ru', 3),
('Кирилл', 'Павлов', '2004-03-03', 'pavlov.337@edu.mai.ru', 3),
('Александра', 'Медведева', '2004-09-25', 'medvedeva.337@edu.mai.ru', 3),
('Даниил', 'Степанов', '2003-11-15', 'stepanov.337@edu.mai.ru', 3);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Георгий', 'Андреев', '2003-05-10', 'andreev.335@edu.mai.ru', 4),
('Виктория', 'Семенова', '2003-08-22', 'semenova.335@edu.mai.ru', 4),
('Тимофей', 'Федоров', '2003-02-28', 'fedorov.335@edu.mai.ru', 4),
('Ульяна', 'Егорова', '2003-11-03', 'egorova.335@edu.mai.ru', 4);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Роман', 'Лебедев', '2004-04-05', 'lebedev.315@edu.mai.ru', 6),
('Алиса', 'Козлова', '2004-07-19', 'kozlova.315@edu.mai.ru', 6),
('Глеб', 'Николаев', '2004-01-30', 'nikolaev.315@edu.mai.ru', 6);


INSERT INTO students (first_name, last_name, date_of_birth, email, group_id) VALUES
('Лев', 'Трофимов', '2005-06-17', 'trofimov.335@edu.mai.ru', 8),
('Мирослава', 'Орлова', '2005-03-29', 'orlova.335@edu.mai.ru', 8),
('Матвей', 'Сергеев', '2005-09-12', 'sergeev.335@edu.mai.ru', 8);


INSERT INTO lessons (date, start_time, end_time, lesson_type, classroom, group_id, discipline_id, professor_id) VALUES
-- Понедельник (М3О-335Б-23, твоя группа)
('2024-03-11', '09:00:00', '10:30:00', 'LECTURE', '316-1', 1, 1, 1),
('2024-03-11', '10:45:00', '12:15:00', 'LECTURE', '316-2', 1, 4, 3),
('2024-03-11', '13:00:00', '14:30:00', 'PRACTICE', '316-3', 1, 7, 7),
-- Вторник
('2024-03-12', '09:00:00', '10:30:00', 'LAB', '316-lab', 1, 1, 2),
('2024-03-12', '10:45:00', '12:15:00', 'PRACTICE', '316-2', 1, 8, 8),
('2024-03-12', '13:00:00', '14:30:00', 'SEMINAR', '403-1', 1, 10, 9),
-- Среда
('2024-03-13', '09:00:00', '10:30:00', 'LECTURE', '316-1', 1, 2, 3),
('2024-03-13', '10:45:00', '12:15:00', 'PRACTICE', '204-1', 1, 11, 10),
('2024-03-13', '13:00:00', '14:30:00', 'LECTURE', '316-1', 1, 3, 1),
-- Четверг
('2024-03-14', '09:00:00', '10:30:00', 'LAB', '316-lab', 1, 4, 3),
('2024-03-14', '10:45:00', '12:15:00', 'PRACTICE', '316-2', 1, 7, 7),
('2024-03-14', '13:00:00', '14:30:00', 'LECTURE', '316-1', 1, 1, 2),
-- Пятница
('2024-03-15', '09:00:00', '10:30:00', 'PRACTICE', '316-2', 1, 2, 4),
('2024-03-15', '10:45:00', '12:15:00', 'LAB', '316-lab', 1, 3, 2),
('2024-03-15', '13:00:00', '14:30:00', 'CONSULTATION', '316-1', 1, 1, 1);